Cannot remake form that is currently cut or joined to other geometry. Please uncut or unjoin first.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FormCreationInvalidGeomCombination { get; }
  Visual Basic
Public Shared ReadOnly Property FormCreationInvalidGeomCombination As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FormCreationInvalidGeomCombination {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FormFailures Class
  Autodesk.Revit.DB Namespace